adhunter/adhunter/api/modules/v1/controllers/CompanyController.php

SELECT * FROM `company_service_area` WHERE (fk_i_company_id = '131') AND (`dt_deleted_at` IS NULL)
---
    public function actionServiceAreaByCompany($companyid)
	{
		$areas = CompanyServiceArea::find()
                  ->where('fk_i_company_id = :fk_i_company_id', [':fk_i_company_id' => $companyid])
                  ->andWhere(['IS','dt_deleted_at',null])
                  ->all();

SELECT * FROM `company_license` WHERE (fk_i_company_id = '131') AND (`dt_deleted_at` IS NULL)
---
	public function actionLiecenseByCompany($companyid)
	{
		$company_licenses = CompanyLicense::find()
                ->where('fk_i_company_id = :company_id', [':company_id' => $companyid])
                ->andWhere(['IS','dt_deleted_at',null])
                ->all();

SELECT * FROM `project` WHERE (`fk_i_company_id`='131') AND (`dt_deleted_at` IS NULL)
---
	public function actionProjectByCompany($companyid)
	{
		$projects = Project::find()
			->where(['fk_i_company_id' => $companyid])
			->andWhere(['IS','dt_deleted_at',null])
			->all();