adhunter/adhunter/api/modules/v1/models/Company.php

SELECT * FROM `subcategory` WHERE `id` IN ('23', '24')
SELECT `company`.* FROM `company` LEFT JOIN `company_serivces` ON `company`.`id` = `company_serivces`.`fk_i_company_id` LEFT JOIN `subcategory` ON `company_serivces`.`fk_i_service_id` = `subcategory`.`id` WHERE (`company`.`id`='131') AND (`subcategory`.`dt_deleted_at` IS NULL)
---
    public function getCategorysOfCompany($id){
        $company = $this::find()
            ->joinWith('subcategory')
            // ->with('subcategory')
            ->where(['company.id' => $id])
            ->andWhere(['IS','subcategory.dt_deleted_at',null])
            ->one();