adhunter/adhunter/api/modules/v1/models/RegistrationForm.php

SELECT * FROM `user` WHERE `i_phone_no`='9981101934'
---
    public function validateMobile()
    {
        if ( !$this->mobile )
        {
                $this->addError('mobile', 'This is Invalid Mobile Number');
        }
        $exists = User::findOne([
            'i_phone_no' => $this->mobile,
        ]);